[
  {
    "id": 0,
    "file": "app/data/md\\Запись фото и видео.md",
    "title": "Запись фото и видео.md",
    "start_tok": 0,
    "end_tok": 270,
    "text": "# Запись фото и видео Включить запись можно из приложения камеры или в окне активного VR-приложения.![image.png](image%203.png) Перед тем как делать запись экрана, советуем изменить настройки камеры. По умолчанию они довольно низкие.![camera-settings.gif](camera-settings.gif) Чтобы из приложения вызвать меню операционной системы, нажмите кнопку **Meta**.![image.png](image%204.png) Откроется окно с кнопками **Сделать фото** и **Записать видео**.![image.png](image%205.png) При нажатии этих кнопок на экране появляется красная лампочка, сигнализирующая о том, что снимается экран. После нажатия **Сделать фото**, запустится таймер в 3 секунды (лампочка будет мигать). Чтобы Вы успели вернуться в приложение, нажав **Продолжить** или снова на кнопку **Meta**, и сделать нужный кадр. После нажатия **Записать видео**, запись будет идти, пока вы не нажмете на ту же кнопку, чтобы прекратить, или пока не снимите шлем."
  },
  {
    "id": 1,
    "file": "app/data/md\\Обмен файлами со шлемом.md",
    "title": "Обмен файлами со шлемом.md",
    "start_tok": 0,
    "end_tok": 644,
    "text": "# Обмен файлами со шлемом ## Способ 1. Через компьютер > Необходим компьютер на ОС Windows и кабель USB-C ↔ USB-C (желательно, комплектный). > Подключаем кабелем шлем к компьютеру. На шлеме появляется уведомление “Обнаружено устройство USB”. Нажимаем на него, чтобы дать разрешение к файлам. На компьютере в проводнике появляется файловая система шлема (внутренний накопитель). --- Если Вам нужны фото/скриншоты или видео, сделанные на шлеме, они хранятся в папке **Oculus/Sreenshots** и **Oculus/Videoshots** соответственно. --- Если Вы хотите перенести файл на шлем. Заходим в любую папку (советуем *Download*) и перекидываем туда необходимый файл. В эту же папку мы будем заходить на самом шлеме. > Хранить файлы в корне устройства (вне внутренних папок) нельзя. Устройство их не увидит. > ## Способ 2. Через WhatsApp > Необходимо войти в свой WhatsApp на шлеме. Данные с телефона не исчезнут. Подходит как обычный, так и бизнес аккаунт. > Приложение WhatsApp можно найти в Библиотеке, так как оно является одним из стандартных и либо уже установлено, либо готово к установке. После авторизации, достаточно отправить файл в чат другому или самому себе. При загрузке фото/видео не забывайте включить HD-режим, чтобы не потерять качество. Если шлемом пользуется кто-то кроме Вас, на приложение WhatsApp (как и на любое другое можно “повесить” пароль). ## Способ 3. Через интернет Для беспроводного обмена нам поможет сервис PairDrop ([ссылка](https://pairdrop.net/)). Сервис бесплатный и не требует регистрации. Чтобы связать устройства, на обоих должен быть включен интернет и открыт сайт. При первом запуске устройству выдается случайное название, по которому его будут видеть другие. Это название можно изменить.![image.png](image%209.png) Снизу показано как это устройство может быть доступно: в рамках одной сети, или в разных сетях (если они связаны). Для обнаружения в одной сети (WiFi) достаточно открыть сайт на обоих устройствах, выключив все программы для шифрования трафика. Нажав на значок другого устройства, откроется проводник где вы можете выбрать какой файл отправить.![image.png](image%2010.png) Для связи устройств из разных сетей, нажимаем на обоих устройствах сверху справа значок **Связать** и вводим на одном из них код второго.![image.png](image%2011.png) После подключения появляется значок Р**едактировать связь**, где вы можете включить автоприём или отвязать устройство.![image.png](image%2012.png)![image.png](image%2013.png)"
  },
  {
    "id": 2,
    "file": "app/data/md\\Обновление шлема.md",
    "title": "Обновление шлема.md",
    "start_tok": 0,
    "end_tok": 700,
    "text": "# Обновление шлема > Сервисы Meta* официально не работают на территории РФ и процесс обновления шлема может занять некоторое время и силы. В этой статье мы поможем Вам разобраться, как это сделать. > Для обновления придётся воспользоваться ВП* / Приложением Шифрования Трафика (далее, сокращенно **ПШТ**). На данный момент существуют 3 способа обновления шлема. Чаще всего пользуются 1 и 2. Для обновления придётся воспользоваться [ВПН**](%D0%9E%D0%B1%D0%BD%D0%BE%D0%B2%D0%BB%D0%B5%D0%BD%D0%B8%D0%B5%20%D1%88%D0%BB%D0%B5%D0%BC%D0%B0%202639a75a58f5805fbf2fec90c3d0f2f8.md). ### Способ 1. Установка приложения на шлем Необходимо скачать *apk*-файл ВПН** программы и установить его на устройство. Инструкция → [Установка сторонних приложений](https://www.notion.so/25c9a75a58f5803486f1e5cf373a6c70?pvs=21) После установки, подключаемся к иностранной локации и устанавливаем обновление. **Настройки** → **Общее** → **Обновление ПО → Обновить**.![image.png](image%2015.png) ### Способ 2. Компьютер и официальный сайт > Необходим компьютер и кабель USB-C ↔ USB-C (желательно, комплектный). > Включаем ВПН** на компьютере (подойдет как приложение, так и браузерное расширение), подключаемся к иностранной локации. Переходим на официальный сайт «Meta Quest. Инструмент обновления ПО» ([ссылка](https://www.meta.com/ru-ru/help/quest/software_update/)). Следуйте инструкциям на сайте. > Важные замечания: Данное решение поддерживает Windows, Mac, Linux через Chrome-подобные браузеры (Google Chrome, Microsoft Edge, Brave). С запуском на Mac лучше экспериментировать вне Safari. Если Вы используете персональный компьютер, подключайте шлем только к материнской плате (сзади). > <aside> Кратко: В начале процесса выключите очки, и удерживайте на выключенных одновременно кнопки питания и уменьшения громкости до появления логотипа Meta. Появится меню запуска (BIOS). С помощью кнопок громкости (+/-) выберите **Sideload Update** кнопкой питания. Экран станет чёрным. Подключите очки к компьютеру и инструмент установит последнее обновление ПО. Это не должно приводить к сбросу настроек, приложений, файлов и данных. </aside>![BIOS Meta Quest 3](image%2016.png) BIOS Meta Quest 3 ### Способ 3. Компьютер на Windows и adb > Необходим компьютер и кабель USB-C ↔ USB-C (желательно, комплектный"
  },
  {
    "id": 3,
    "file": "app/data/md\\Обновление шлема.md",
    "title": "Обновление шлема.md",
    "start_tok": 600,
    "end_tok": 1269,
    "text": "ран станет чёрным. Подключите очки к компьютеру и инструмент установит последнее обновление ПО. Это не должно приводить к сбросу настроек, приложений, файлов и данных. </aside>![BIOS Meta Quest 3](image%2016.png) BIOS Meta Quest 3 ### Способ 3. Компьютер на Windows и adb > Необходим компьютер и кабель USB-C ↔ USB-C (желательно, комплектный). > 1. Выключаем шлем, отсоединяем кабель. 2. Зажимаем “звук минус” (ближе к носу) и кнопку питания. Как только увидели логотип - отпускаем кнопки 3. Кнопками громкости выбираем пункт **Sideload Update**. Для выбора нажимаем кнопку питания. 4. Подключаем устройство к компьютеру. 5. На компьютере запускаем START ME TO UPDATE и ждём, пока обновление загрузится и установится. ### Способ 4. Раздать интернет с компьютера 1. Для начала вам потребуется любой компьютер, позволяющий раздавать интернет (ноутбук или ПК с Wi-Fi модулем). Заходим в *Параметры* Windows -> *Сеть и Интернет* -> *Мобильный хот-спот*. Включаем его и запоминаем название сети и пароль для доступа. 2. Также для корректной работы потребуется установка ВПН**. Подойдет любое, позволяющее раздавать интернет и не сильно ограничивающее по скорости. 3. Открываем **Сетевые подключения**. 1. Для этого сочетанием клавиш Win+R, вызываем окно выполнения и прописываем команду **ncpa.cpl**. 2. Либо переходим в **Панель управления** → **Сеть и интернет** → **Сетевые подключения**. 4. Здесь находим адаптер, который предоставило приложение. **Правая кнопка мыши** → **Свойства** → **Доступ**. 5. В пункте **Подключение домашней сети** выбираем нашу сеть хот-спот (обычно она называется **Подключение по локальной сети**) и ставим галочку *Разрешить другим пользователям использовать подключение к Интернету данного компьютера*. > * Meta Platforms Inc. признана экстремистской организацией и запрещена на территории Российской Федерации. Устройство Meta Quest 3, упоминаемое в данном материале, является её продуктом. Настоящая публикация носит исключительно технический и информационный характер и не направлена на продвижение, пропаганду или рекламу деятельности или продукции вышеуказанной компании. > > ** Здесь описывается техническая возможность использования VPN для обновления устройства Meta Quest 3. Использование VPN не запрещено законом России для законных целей, таких как защита данных или доступ к обновлениям. В статье не содержится призывов к обходу блокировок или рекламы VPN-сервисов. Настоящая публикация носит исключительно технический и информационный характер. KARTOTEKA не несет ответственности за использование информации в нарушение законодательства. >"
  },
  {
    "id": 4,
    "file": "app/data/md\\Операционная система.md",
    "title": "Операционная система.md",
    "start_tok": 0,
    "end_tok": 258,
    "text": "# Операционная система **Meta*** **Horizon OS** — операционная система, основанная на Android. Это значит, что её интерфейс будет схож с тем, к чему Вы уже привыкли на телефоне. И ориентироваться в нем не составит труда. ## Панель управления![image.png](image%201.png) 1. Профиль (имя, аватар, биография) 2. Быстрые настройки (WiFi, Bluetooth, звук, яркость и т.д.) 3. Уведомления 4. Сквозная камера (вкл/выкл окружение) 5. Закрепленные приложения 6. Последние приложения 7. Библиотека приложений За полосу снизу можно перемещать окна (такая же возможность есть в Kartoteka). ## Окна Окна можно перемещать, потянув за плашку с названием под самим окном. Максимум на экране можно разместить 6 окон (3 закрепленных и 3 открепленных).![mq3 window (1).gif](mq3_window_(1).gif)![image.png](image%202.png) ## Настройки Быстрые настройки Настройки шлема"
  },
  {
    "id": 5,
    "file": "app/data/md\\Питание шлема.md",
    "title": "Питание шлема.md",
    "start_tok": 0,
    "end_tok": 304,
    "text": "# Питание шлема ### Комплектация Мы предоставляем (и рекомендуем, если Вы покупали шлем самостоятельно) аксессуары компании BoboVR. К оголовью BoboVR M3 Pro в комплекте уже идет дополнительный аккумулятор B2.![Оголовье M3 Pro](image%2017.png) Оголовье M3 Pro Включенный шлем держит заряд примерно 2-3 часа в операционной системе и 1-1.5 в требовательных приложениях. Дополнительный аккумулятор увеличивает это значение в 1.5 раза. Чтобы аккумулятор питал шлем, необходимо прикрепить его магнитами к оголовью. Идущий из оголовья USB-C кабель воткнуть в порт передней части шлема.![Аккумулятор B2](image%2018.png) Аккумулятор B2 Для зарядки шлема и подключения к компьютеру, используйте комплектный кабель *USB-C* ↔ *USB-C*, либо аналогичный (*USB 3.1 Gen 1* или *USB 3.2 Gen 1*). ### Настройки питания В настройках шлема можно регулировать настройки питания. Рекомендуем выключить **Экономию батареи**, которая понижает производительность приложений. Данное меню находится в **Настройки → Общее → Питание**.![image.png](image%2019.png)"
  },
  {
    "id": 6,
    "file": "app/data/md\\Руки и контроллеры.md",
    "title": "Руки и контроллеры.md",
    "start_tok": 0,
    "end_tok": 498,
    "text": "# Руки и контроллеры ## Управление контроллерами![image.png](image.png) В основном, действия выполняются правым контроллером, будь то операционная система или приложение Kartoteka. Подробно о каждой кнопке на контроллерах: - Главной кнопкой является курок (триггер), как на левом, так и на правом контроллере. Её можно воспринимать, как левую кнопку мыши на компьютерной мыши. Все взаимодействия с интерфейсом (выбор, клик, удержать) происходят кликом на курок. - Кнопки хвата являются второстепенными. - В меню, стики позволяют листать длинные списки. А в приложениях — вращать и перемещать объекты. - Кнопки **A**, **B**, **X**, **Y**, **MENU** принимают на себя роль функций в конкретных приложениях. - Кнопка **META** при одиночном нажатии показывает и скрывает меню операционной системы. При длительном нажатии, происходит выравнивание интерфейса/сцены относительно камеры.![controller-preview (2).gif](controller-preview_(2).gif) Взаимодействуйте с интерфейсом, направляя контроллер в нужную сторону. От курка идет луч. Контроллеры не имеют собственных камер — они отслеживаются камерной системой самой гарнитуры Meta* Quest 3. Это значит, что если шлем потеряет из поля зрения контроллер — он потеряет над ним управление. ## Управление руками Контроллеры не обязательны во многих играх и приложениях, поскольку Meta* активно развивает отслеживание рук. Однако: - Контроллеры обеспечивают более точный и отзывчивый контроль. - На контроллер можно назначить больше действий, так как на каждом есть по 6 кнопок. Взаимодействовать с интерфейсом руками можно двумя способами: Щипок. Направление луча идёт от большого и указательного пальца. Сомкните их, чтобы произвести клик. [Видео/гиф] Нажатие пальцами. Меню реагирует только на указательный палец. Необходимо “проткнуть” кнопку, чтобы она среагировала. [Видео/гиф]"
  },
  {
    "id": 7,
    "file": "app/data/md\\Трансляция (демонстрация экрана).md",
    "title": "Трансляция (демонстрация экрана).md",
    "start_tok": 0,
    "end_tok": 700,
    "text": "# Трансляция (демонстрация экрана) <aside> В шлеме есть официальный способ трансляции со шлема на сайт. Нам он не подходит, так как требует ВПН на обеих сторонах, что создает дополнительные трудности каждый раз при запуске трансляции и понижает скорость интернета. А еще этим способом нельзя транслировать без интернета. Поэтому воспользуемся способами, которые позволяют транслировать экран шлема, как обычного Android-устройства. </aside> Если далее по инструкции, необходимо установить приложение → [Установка сторонних приложений](https://www.notion.so/25c9a75a58f5803486f1e5cf373a6c70?pvs=21). ## Локально Для трансляции в рамках одного WiFi понадобится установить приложение на шлем. | | LetsView | AirDroid Cast | | --- | --- | --- | | Плюсы | + Работает без интернета | + Не нужна установка, работает в браузере + Есть перевод на русский | | Минусы | - Нет перевода на русский - Необходимо установить приложение | - Необходим интернет для подключения к серверу | Как пользоваться (раскрывающийся список): - LetsView Приложение доступно для любых устройств ([ссылка на оф. сайт](https://letsview.com/download-letsview)). Для шлема и android-устройств без Google Play скачайте установочный файл ([ссылка для скачивания](https://drive.google.com/file/d/11Fg5gCXC_Z6Ff8ZxhnSbywcuZZ97e7v4/view?usp=sharing)). Установив программу на оба устройства (транслирующее и принимающее), при запуске необходимо согласиться с политикой конфиденциальности приложения (нажмите ***Agree***).![image.png](image%206.png) В интерфейсе приложения нам важны 3 пункта: имя устройства, код устройства, введение кода. Устройства связываются в одной сети по коду. Схема подключения: На устройстве (1), откуда транслируется экран, вводим код устройства (2), где смотрим трансляцию. Например, я хочу вывести экран с очков (1) на компьютер (2). Захожу в приложение на очках. Нажимаю **Ввести код** → вписываю код, отображаемый на компьютер**е.** В окне «**Выберите чем поделиться»** выбираем **Полный обзор**. - AirDroid Приложение доступно для любых устройств ([ссылка на оф. сайт](https://www.airdroid.com/download/airdroid-cast/)). Для шлема и android-устройств без Google Play скачайте установочный файл ([ссылка для скачивания](https://drive.google.com/file/d/11Fg5gCXC_Z6Ff8ZxhnSbywcuZZ97e7v4/view?usp=sharing)). Также сервис трансляция отлично работает через сайт (["
  },
  {
    "id": 8,
    "file": "app/data/md\\Трансляция (демонстрация экрана).md",
    "title": "Трансляция (демонстрация экрана).md",
    "start_tok": 600,
    "end_tok": 1097,
    "text": "airdroid.com/download/airdroid-cast/)). Для шлема и android-устройств без Google Play скачайте установочный файл ([ссылка для скачивания](https://drive.google.com/file/d/11Fg5gCXC_Z6Ff8ZxhnSbywcuZZ97e7v4/view?usp=sharing)). Также сервис трансляция отлично работает через сайт ([ссылка](https://webcast.airdroid.com/)). Как бы Вы не запустили платформу (через сайт или приложение), на выбор предлагается две страницы: **Трансляция экрана** и **Получение экрана**.![image.png](image%207.png) Схема подключения: На устройстве (1), откуда транслируется экран, вводим код устройства (2), где смотрим трансляцию. Например, я хочу вывести экран с очков (1) на компьютер (2). Захожу в приложение на очках. Нажимаю **Ввести код** → вписываю код, отображаемый на компьютер**е.** В окне «**Выберите чем поделиться»** выбираем **Полный обзор**. ## Дистанционно | | Яндекс Телемост | Pin.gl | Anydesk | | --- | --- | --- | --- | | Плюсы | + Работает в браузере + Стабильная работа в России + Есть перевод на русский | + Работает в браузере + Не нужна регистрация | + Есть перевод на русский | | Минусы | - Необходим вход в аккаунт для запуска звонка | - Нет перевода на русский - Не всегда работает | - Трансляция не плавная - Необходимо установить приложение | Как пользоваться (раскрывающийся список): - Яндекс Телемост![image.png](image%208.png) На устройстве, принимающем трансляцию входим в Яндекс аккаунт и создаем звонок (создать видеовстречу / новая видеовстреча). Подключаемся с очков, по ссылке или введя код встречи. Подключившись, нажимаем **Демонстрация** → **Полный обзор**."
  },
  {
    "id": 9,
    "file": "app/data/md\\Установка сторонних приложений.md",
    "title": "Установка сторонних приложений.md",
    "start_tok": 0,
    "end_tok": 506,
    "text": "# Установка сторонних приложений Для установки приложения будем пользоваться *apk*-файлом. Это стандартное расширение установки программ на Android. Получить apk-файл Вы можете отправив его с другого устройства (инструкция ниже) или найти файл через встроенный браузер в шлеме (скачивайте файлы только из проверенных источников). Инструкция → [Обмен файлами со шлемом](https://www.notion.so/2619a75a58f58047a69af81e2087e390?pvs=21) ## Установить приложение Чтобы найти *apk*-файл на шлеме, необходимо открыть стандартный файловый менеджер Android. В Meta Quest 3 по умолчанию это недоступно. Но это доступно через приложение ***Kartoteka***! Запускаем приложение ***Kartoteka*** и переходим на вкладку **Контакты**. Здесь, в разделе **Полезные ссылки**, кликаем на пункт **Файловый менеджер**. Откроется приложение без названия. Это и есть стандартный файловый менеджер Android. Нужно найти переданный файл в системе. Открываем боковое меню. Если Вы воспользовались способом через компьютер и переместили файл в папку *Download*, он будет лежать в **Скачанных**. Иначе, заходим в раздел **Quest 3**. Это внутреннее хранилище устройства. - Как найти файл, если он переслан по WhatsApp? Предварительно откройте WhatsApp и в чате, где Вы переслали файл, кликните по нему. Вероятно, появится ошибка о невозможности установки приложения таким образом. Это нормально. Нам необходимо было лишь сохранить файл в системе. Теперь переходим в упомянутый ранее **Файловый менеджер** → ****раздел **Quest 3**. Здесь ищем файл по пути *Android/media/com.whatsapp/WhatsApp/Media/WhatsApp Documents*. Файл может быть либо в папке *Private*, либо *Sent*. Нашли свой файл, открываем его. <aside> Важно: если у Вас есть значок “раскрыть”, нажимайте на него, иначе просто по названию файла. </aside> При установке стороннего приложения в первый раз, необходимо дать разрешение.![image.png](image%2014.png)"
  }
]